# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-06 18:17:24 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* BackupClean [0/1]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  BackupClean is a small, simple-minded (I hope) Python application to help me
  clean up old archives created with borg.
  I know such a tool exists already, but I was looking for a small project to
  keep me busy. Other people solve crossword puzzles or stuff like that. I
  code.
** Timetable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-03-06 Do 18:17]
   | Headline                                        | Time   |        |      |      |
   |-------------------------------------------------+--------+--------+------+------|
   | *Total time*                                    | *6:02* |        |      |      |
   |-------------------------------------------------+--------+--------+------+------|
   | *BackupClean [0/1]*                             | *6:02* |        |      |      |
   | \_  /Components [0/1]/                          |        | /6:02/ |      |      |
   | \_    Talking to Borg [0/0]                     |        |        | 0:23 |      |
   | \_    Clean up old backups [0/1]                |        |        | 5:39 |      |
   | \_      Selecting which backups to delete vs... |        |        |      | 1:31 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Talking to Borg [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-05 Mi 14:51]--[2025-03-05 Mi 15:14] =>  0:23
    :END:
*** Clean up old backups [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-05 Mi 15:30]--[2025-03-05 Mi 19:38] =>  4:08
    :END:
    I need a way to express which backups I want to keep.
    Something like this: For the past 14 days, I want to keep all backups; for
    the past 12 weeks, I want to keep one backup per week, and for the past 2
    years, I want to keep one per month.
    This actually fairly tricky. Cussword!
    I could use something analogous to the sieve of Eratosthenes, where I
    iterate over a list of backups repeatedly, picking out the ones I want to
    delete and keep.
    Another layer of tricky is that some of my systems do not produce a backup
    every day because they are not running all the time. So keeping the backup
    from, say, Monday, is not going to work if in that week, we only have
    backups from Tuesday, Wednesday, and Saturday.
    So the first step is: Anything younger than x days? You stay.
    The rest, we group into bins
**** TODO Selecting which backups to delete vs keep
     :LOGBOOK:
     CLOCK: [2025-03-06 Do 16:45]--[2025-03-06 Do 18:16] =>  1:31
     :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
